notas/app/controllers/degrees_controller.rb

  def index
    @degrees = Degree.all
---
SELECT * FROM `degrees` ORDER BY name

  def show
    @degree = Degree.find(params[:id])
---
SELECT * FROM `degrees` WHERE (`degrees`.`id` = 1) ORDER BY name

  def edit
    @degree = Degree.find(params[:id])
---
SELECT * FROM `degrees` WHERE (`degrees`.`id` = 2) ORDER BY name

  def create
    @degree = Degree.new(params[:degree])

    respond_to do |format|
      if @degree.save
---
INSERT INTO `degrees` (`name`, `created_at`, `updated_at`) VALUES('Ingeniería Técnica en Informágica de Gestión', '2011-07-15 11:16:12', '2011-07-15 11:16:12')

  def destroy
    @degree = Degree.find(params[:id])
---
SELECT * FROM `degrees` WHERE (`degrees`.`id` = 2) ORDER BY name