notas/app/controllers/evaluations_controller.rb

SELECT * FROM `signatures` WHERE (`signatures`.`id` = 1)
---
  def find_signature_and_exam
    @signature = Signature.find params[:signature_id]