notas/app/controllers/home_controller.rb

SELECT * FROM `years` WHERE (`years`.`id` = 1) ORDER BY start_year
---
  def change_year
    @year_selected = Year.find(params[:id])

SELECT * FROM `degrees` WHERE (`degrees`.`id` = 2) ORDER BY name
---
  def change_degree
    @degree_selected = Degree.find(params[:id])