notas/app/controllers/parts_controller.rb

SELECT * FROM `parts` WHERE (ordinary=1) AND (`parts`.signature_id = 3)
---
  def index
    @parts = @signature.parts.all :conditions=>['ordinary=?',@ordinary]

SELECT * FROM `signatures` WHERE (`signatures`.`id` = 3)
---
  def find_signature_and_ordinary
     @signature = Signature.find params[:signature_id]