notas/app/controllers/signatures_controller.rb

  def index
    if current_user.is_a? Administrator
      @signatures = Signature.all
    else
      @signatures = current_user.signatures.find(:all, :conditions=>['year_id = ?', @year_selected])
---
SELECT * FROM `signatures` WHERE (`signatures`.degree_id = 1)
SELECT * FROM `signatures` INNER JOIN `signatures_teachers` ON `signatures`.id = `signatures_teachers`.signature_id WHERE (`signatures_teachers`.teacher_id = 2 AND (year_id = 2)) ORDER BY name

  def show
    if current_user.is_a? Administrator
      @signature = Signature.find(params[:id])
    else
      @signature = current_user.signatures.find(params[:id], :conditions=>['year_id = ?', @year_selected])
---
SELECT * FROM `signatures` WHERE (`signatures`.`id` = 1)
SELECT * FROM `signatures` INNER JOIN `signatures_teachers` ON `signatures`.id = `signatures_teachers`.signature_id WHERE (`signatures`.`id` = 1 AND (`signatures_teachers`.teacher_id = 2 AND (year_id = 2))) ORDER BY name

  def edit
    @signature = Signature.find(params[:id])
---
SELECT * FROM `signatures` WHERE (`signatures`.`id` = 1)

  def create
    @signature = Signature.new(params[:signature])

    respond_to do |format|
      if @signature.save
---
INSERT INTO `signatures` (`name`, `created_at`, `degree_id`, `updated_at`) VALUES('Matemáticas', '2011-07-15 11:16:57', 1, '2011-07-15 11:16:57')

  def update
    @signature = Signature.find(params[:id])

    respond_to do |format|
      if @signature.update_attributes(params[:signature])
---
SELECT * FROM `signatures` WHERE (`signatures`.`id` = 1)
UPDATE `signatures` SET `updated_at` = '2011-07-15 11:18:50', `name` = 'Matemáticas' WHERE `id` = 3

  def destroy
    @signature = Signature.find(params[:id])
    @signature.destroy rescue flash[:notice] = 'No se puede borrar la asignatura'
---
SELECT * FROM `signatures` WHERE (`signatures`.`id` = 1)
DELETE FROM `signatures` WHERE `id` = 2

  def create_student
    @signature = Signature.find(params[:id])
    @signatures_student = @signature.signatures_students.build(params[:signatures_student])

    respond_to do |format|
      if @signatures_student.save
---
SELECT * FROM `signatures` WHERE (`signatures`.`id` = 2)
INSERT INTO `signatures_students` (`student_id`, `average1`, `average2`, `calification1`, `calification2`, `signature_id`, `ordinary`, `year_id`) VALUES(3, NULL, NULL, NULL, NULL, 1, NULL, 2)

  def create_teacher
    @signature = Signature.find(params[:id])
    @signatures_teacher = @signature.signatures_teachers.build(params[:signatures_teacher])

    respond_to do |format|
      if @signatures_teacher.save
---
SELECT * FROM `signatures` WHERE (`signatures`.`id` = 1)
INSERT INTO `signatures_teachers` (`signature_id`, `teacher_id`, `year_id`) VALUES(1, 2, 1)

  def destroy_teacher
    @signature = Signature.find(params[:id])
    @signature_teacher = @signature.signatures_teachers.find(:first,
      :conditions=>['year_id=? AND teacher_id=?', params[:year_id], params[:teacher_id]])
    @signature_teacher.destroy #rescue flash[:notice] = 'No se puede borrar al profesor de esta asignatura'
---
SELECT * FROM `signatures` WHERE (`signatures`.`id` = 1)
SELECT * FROM `signatures_teachers` WHERE (`signatures_teachers`.signature_id = 1 AND (year_id='2' AND teacher_id='2')) LIMIT 1
DELETE FROM `signatures_teachers` WHERE `id` = 2

  def destroy_student
    @signature = Signature.find(params[:id])
    @signature_student = @signature.signatures_students.find(:first,
      :conditions=>['year_id=? AND student_id=?', params[:year_id], params[:student_id]])
    @signature_student.destroy rescue flash[:notice] = 'No se puede borrar al alumno de esta asignatura'
---
SELECT * FROM `signatures` WHERE (`signatures`.`id` = 1)
SELECT * FROM `signatures_students` WHERE (`signatures_students`.signature_id = 1 AND (year_id='2' AND student_id='3')) LIMIT 1
DELETE FROM `signatures_students` WHERE `id` = 2