notas/app/controllers/signatures_controller.rb

SELECT * FROM `signatures_students` WHERE (`signatures_students`.signature_id = 1 AND (year_id=2))
SELECT `signatures`.* FROM `signatures` INNER JOIN signatures_students ON signature_id=signatures.id WHERE (year_id=1 AND student_id=3)
---
  def create_student
    @signature = Signature.find(params[:id])
    @signatures_student = @signature.signatures_students.build(params[:signatures_student])
    # si lo matriculas por ordinaria septiembre
    if (!@signatures_student.ordinary) && @signatures_student.enabled2
      matricula = @signature.signatures_students.find :first, :conditions=> {