notas/app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `expedient`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `type`, `remember_token`, `login`, `email`) VALUES('Usuario Administrador UPSA', '2498b1737d3064aa3c275ace5a4db2a017a805ad', '2011-04-19 16:02:58', NULL, 'cde2f8b28168a2e031425d5376eb67f1d1fb555f', NULL, '2011-04-19 16:02:58', 'Administrator', NULL, 'admin', 'admin@upsa.es')
SELECT count(*) AS count_all FROM `users` WHERE ( (`users`.`type` = 'Administrator' ) )
---
  def create
    logout_keeping_session!
    @user = Administrator.new(params[:user])
    success = @user && @user.save
    if success && @user.errors.empty?