notas/app/controllers/years_controller.rb

SELECT * FROM `years` ORDER BY start_year
---
  def index
    @years = Year.all

SELECT * FROM `years` WHERE (`years`.`id` = 2) ORDER BY start_year
---
  def show
    @year = Year.find(params[:id])

SELECT * FROM `years` WHERE (`years`.`id` = 2) ORDER BY start_year
---
  def edit
    @year = Year.find(params[:id])

INSERT INTO `years` (`created_at`, `updated_at`, `start_year`) VALUES('2011-07-15 12:11:20', '2011-07-15 12:11:20', 2011)
---
  def create
    @year = Year.new(params[:year])

    respond_to do |format|
      if @year.save

SELECT * FROM `years` WHERE (`years`.`id` = 2) ORDER BY start_year
---
  def destroy
    @year = Year.find(params[:id])